// Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк,
//  длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, 
//  либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, 
//  лучше обойтись исключительно массивами.


string[] arrayOne = new string[5] { "hello", "hi", "qw78", "people", "asd" };
string[] arrayTwo = new string[arrayOne.Length];


void CompareArray (string[] arrayOne, string[] arrayTwo)
{
    int count = 0;
    for (int i = 0; i < arrayOne.Length; i++)
    {
        if (arrayOne[i].Length <= 3)
        {
            arrayTwo[count] = arrayOne[i];
            count++;
        }
    }
}
void PrintArray(string[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)

    {

        Console.Write($"{array[i]} ");
    }
    Console.WriteLine("]");
}



CompareArray(arrayOne, arrayTwo);
PrintArray(arrayTwo);